#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usersessionmodel-note-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_prod.module.onestopauth.module.client_sasa-1553.keycloak_generic_client_protocol_mapper.idir_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_prod.module.onestopauth.module.client_sasa-1553.keycloak_openid_client.this will be created
  + resource "keycloak_openid_client" "this" {
      + access_type                              = "PUBLIC"
      + client_id                                = "sasa-1553"
      + client_secret                            = (sensitive value)
      + consent_required                         = false
      + direct_access_grants_enabled             = false
      + enabled                                  = true
      + exclude_session_state_from_auth_response = false
      + full_scope_allowed                       = true
      + id                                       = (known after apply)
      + implicit_flow_enabled                    = false
      + name                                     = "sasa-1553"
      + pkce_code_challenge_method               = "S256"
      + realm_id                                 = "onestopauth"
      + resource_server_id                       = (known after apply)
      + service_account_user_id                  = (known after apply)
      + service_accounts_enabled                 = false
      + standard_flow_enabled                    = true
      + valid_redirect_uris                      = [
          + "http://c",
        ]
      + web_origins                              = [
          + "+",
        ]
    }

  # module.keycloak_test.module.onestopauth.module.client_asdfsafa-1322.keycloak_openid_client.this will be updated in-place
  ~ resource "keycloak_openid_client" "this" {
        id                                       = "34ebfcc9-1348-484f-a918-198336d20505"
        name                                     = "asdfsafa-1322"
      ~ valid_redirect_uris                      = [
          - "http://www.google.ca",
          + "http://www.google.ca12133",
        ]
        # (13 unchanged attributes hidden)
    }

  # module.keycloak_test.module.onestopauth.module.client_aug-10-4-pm-470.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper will be destroyed
  - resource "keycloak_generic_client_protocol_mapper" "bceid_business_guid_mapper" {
      - client_id       = "22be4a9f-7507-45f6-8f23-b92b5d7b76eb" -> null
      - config          = {
          - "access.token.claim"   = "true"
          - "claim.name"           = "bceid_business_guid"
          - "id.token.claim"       = "true"
          - "jsonType.label"       = "String"
          - "user.attribute"       = "bceid_business_guid"
          - "userinfo.token.claim" = "true"
        } -> null
      - id              = "cba20ae8-f1d3-4486-b628-4399e29c2f1c" -> null
      - name            = "bceid_business_guid" -> null
      - protocol        = "openid-connect" -> null
      - protocol_mapper = "oidc-usermodel-attribute-mapper" -> null
      - realm_id        = "onestopauth" -> null
    }

  # module.keycloak_test.module.onestopauth.module.client_aug-10-4-pm-470.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper will be destroyed
  - resource "keycloak_generic_client_protocol_mapper" "bceid_business_name_mapper" {
      - client_id       = "22be4a9f-7507-45f6-8f23-b92b5d7b76eb" -> null
      - config          = {
          - "access.token.claim"   = "true"
          - "claim.name"           = "bceid_business_name"
          - "id.token.claim"       = "true"
          - "jsonType.label"       = "String"
          - "user.attribute"       = "bceid_business_name"
          - "userinfo.token.claim" = "true"
        } -> null
      - id              = "0c51c30c-8907-4316-8b1a-7d193db0e9cd" -> null
      - name            = "bceid_business_name" -> null
      - protocol        = "openid-connect" -> null
      - protocol_mapper = "oidc-usermodel-attribute-mapper" -> null
      - realm_id        = "onestopauth" -> null
    }

  # module.keycloak_test.module.onestopauth.module.client_aug-10-4-pm-470.keycloak_generic_client_protocol_mapper.bceid_userid_mapper will be destroyed
  - resource "keycloak_generic_client_protocol_mapper" "bceid_userid_mapper" {
      - client_id       = "22be4a9f-7507-45f6-8f23-b92b5d7b76eb" -> null
      - config          = {
          - "access.token.claim"   = "true"
          - "claim.name"           = "bceid_userid"
          - "id.token.claim"       = "true"
          - "jsonType.label"       = "String"
          - "user.attribute"       = "bceid_userid"
          - "userinfo.token.claim" = "true"
        } -> null
      - id              = "006dd12f-ccab-4816-9d22-e34a19c09f9c" -> null
      - name            = "bceid_userid" -> null
      - protocol        = "openid-connect" -> null
      - protocol_mapper = "oidc-usermodel-attribute-mapper" -> null
      - realm_id        = "onestopauth" -> null
    }

  # module.keycloak_test.module.onestopauth.module.client_aug-10-4-pm-470.keycloak_generic_client_protocol_mapper.client_roles_mapper will be destroyed
  - resource "keycloak_generic_client_protocol_mapper" "client_roles_mapper" {
      - client_id       = "22be4a9f-7507-45f6-8f23-b92b5d7b76eb" -> null
      - config          = {
          - "access.token.claim"                   = "true"
          - "claim.name"                           = "client_roles"
          - "id.token.claim"                       = "true"
          - "jsonType.label"                       = "String"
          - "multivalued"                          = "true"
          - "userinfo.token.claim"                 = "true"
          - "usermodel.clientRoleMapping.clientId" = "aug-10-4-pm-470"
        } -> null
      - id              = "d597fb1d-7416-4521-970c-8cdb89733b8b" -> null
      - name            = "client_roles" -> null
      - protocol        = "openid-connect" -> null
      - protocol_mapper = "oidc-usermodel-client-role-mapper" -> null
      - realm_id        = "onestopauth" -> null
    }

  # module.keycloak_test.module.onestopauth.module.client_aug-10-4-pm-470.keycloak_generic_client_protocol_mapper.identity_provider_mapper will be destroyed
  - resource "keycloak_generic_client_protocol_mapper" "identity_provider_mapper" {
      - client_id       = "22be4a9f-7507-45f6-8f23-b92b5d7b76eb" -> null
      - config          = {
          - "access.token.claim"         = "true"
          - "access.tokenResponse.claim" = "false"
          - "claim.name"                 = "identity_provider"
          - "id.token.claim"             = "true"
          - "jsonType.label"             = "String"
          - "user.session.note"          = "identity_provider"
        } -> null
      - id              = "cc4ef719-b0c5-45ab-911c-f9a57a7ff6d0" -> null
      - name            = "IDP" -> null
      - protocol        = "openid-connect" -> null
      - protocol_mapper = "oidc-usersessionmodel-note-mapper" -> null
      - realm_id        = "onestopauth" -> null
    }

  # module.keycloak_test.module.onestopauth.module.client_aug-10-4-pm-470.keycloak_generic_client_protocol_mapper.idir_userid_mapper will be destroyed
  - resource "keycloak_generic_client_protocol_mapper" "idir_userid_mapper" {
      - client_id       = "22be4a9f-7507-45f6-8f23-b92b5d7b76eb" -> null
      - config          = {
          - "access.token.claim"   = "true"
          - "claim.name"           = "idir_userid"
          - "id.token.claim"       = "true"
          - "jsonType.label"       = "String"
          - "user.attribute"       = "idir_userid"
          - "userinfo.token.claim" = "true"
        } -> null
      - id              = "562b63bb-dc69-4f5d-8252-f6bddf8d6d26" -> null
      - name            = "idir_userid" -> null
      - protocol        = "openid-connect" -> null
      - protocol_mapper = "oidc-usermodel-attribute-mapper" -> null
      - realm_id        = "onestopauth" -> null
    }

  # module.keycloak_test.module.onestopauth.module.client_aug-10-4-pm-470.keycloak_openid_client.this will be destroyed
  - resource "keycloak_openid_client" "this" {
      - access_type                              = "PUBLIC" -> null
      - client_id                                = "aug-10-4-pm-470" -> null
      - client_secret                            = (sensitive value)
      - consent_required                         = false -> null
      - direct_access_grants_enabled             = false -> null
      - enabled                                  = true -> null
      - exclude_session_state_from_auth_response = false -> null
      - full_scope_allowed                       = true -> null
      - id                                       = "22be4a9f-7507-45f6-8f23-b92b5d7b76eb" -> null
      - implicit_flow_enabled                    = false -> null
      - name                                     = "aug-10-4-pm-470" -> null
      - pkce_code_challenge_method               = "S256" -> null
      - realm_id                                 = "onestopauth" -> null
      - service_accounts_enabled                 = false -> null
      - standard_flow_enabled                    = true -> null
      - valid_redirect_uris                      = [
          - "https://www.google.ca",
        ] -> null
      - web_origins                              = [
          - "+",
        ] -> null
    }

  # module.keycloak_test.module.onestopauth.module.client_aug-31-424-pm-1323.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper will be destroyed
  - resource "keycloak_generic_client_protocol_mapper" "bceid_business_guid_mapper" {
      - client_id       = "29c41173-7c35-4dd2-b532-85513c0168fb" -> null
      - config          = {
          - "access.token.claim"   = "true"
          - "claim.name"           = "bceid_business_guid"
          - "id.token.claim"       = "true"
          - "jsonType.label"       = "String"
          - "user.attribute"       = "bceid_business_guid"
          - "userinfo.token.claim" = "true"
        } -> null
      - id              = "3f9170f9-a962-42cb-b9d6-9e7d339dcc87" -> null
      - name            = "bceid_business_guid" -> null
      - protocol        = "openid-connect" -> null
      - protocol_mapper = "oidc-usermodel-attribute-mapper" -> null
      - realm_id        = "onestopauth" -> null
    }

  # module.keycloak_test.module.onestopauth.module.client_aug-31-424-pm-1323.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper will be destroyed
  - resource "keycloak_generic_client_protocol_mapper" "bceid_business_name_mapper" {
      - client_id       = "29c41173-7c35-4dd2-b532-85513c0168fb" -> null
      - config          = {
          - "access.token.claim"   = "true"
          - "claim.name"           = "bceid_business_name"
          - "id.token.claim"       = "true"
          - "jsonType.label"       = "String"
          - "user.attribute"       = "bceid_business_name"
          - "userinfo.token.claim" = "true"
        } -> null
      - id              = "12a8562e-1c66-4529-a7e1-7de9e7556ab5" -> null
      - name            = "bceid_business_name" -> null
      - protocol        = "openid-connect" -> null
      - protocol_mapper = "oidc-usermodel-attribute-mapper" -> null
      - realm_id        = "onestopauth" -> null
    }

  # module.keycloak_test.module.onestopauth.module.client_aug-31-424-pm-1323.keycloak_generic_client_protocol_mapper.bceid_userid_mapper will be destroyed
  - resource "keycloak_generic_client_protocol_mapper" "bceid_userid_mapper" {
      - client_id       = "29c41173-7c35-4dd2-b532-85513c0168fb" -> null
      - config          = {
          - "access.token.claim"   = "true"
          - "claim.name"           = "bceid_userid"
          - "id.token.claim"       = "true"
          - "jsonType.label"       = "String"
          - "user.attribute"       = "bceid_userid"
          - "userinfo.token.claim" = "true"
        } -> null
      - id              = "1274d062-dde2-412d-add4-b0408182422d" -> null
      - name            = "bceid_userid" -> null
      - protocol        = "openid-connect" -> null
      - protocol_mapper = "oidc-usermodel-attribute-mapper" -> null
      - realm_id        = "onestopauth" -> null
    }

  # module.keycloak_test.module.onestopauth.module.client_aug-31-424-pm-1323.keycloak_generic_client_protocol_mapper.client_roles_mapper will be destroyed
  - resource "keycloak_generic_client_protocol_mapper" "client_roles_mapper" {
      - client_id       = "29c41173-7c35-4dd2-b532-85513c0168fb" -> null
      - config          = {
          - "access.token.claim"                   = "true"
          - "claim.name"                           = "client_roles"
          - "id.token.claim"                       = "true"
          - "jsonType.label"                       = "String"
          - "multivalued"                          = "true"
          - "userinfo.token.claim"                 = "true"
          - "usermodel.clientRoleMapping.clientId" = "aug-31-424-pm-1323"
        } -> null
      - id              = "fc1e28d0-ce21-4546-93e8-c69bdb762700" -> null
      - name            = "client_roles" -> null
      - protocol        = "openid-connect" -> null
      - protocol_mapper = "oidc-usermodel-client-role-mapper" -> null
      - realm_id        = "onestopauth" -> null
    }

  # module.keycloak_test.module.onestopauth.module.client_aug-31-424-pm-1323.keycloak_generic_client_protocol_mapper.identity_provider_mapper will be destroyed
  - resource "keycloak_generic_client_protocol_mapper" "identity_provider_mapper" {
      - client_id       = "29c41173-7c35-4dd2-b532-85513c0168fb" -> null
      - config          = {
          - "access.token.claim"         = "true"
          - "access.tokenResponse.claim" = "false"
          - "claim.name"                 = "identity_provider"
          - "id.token.claim"             = "true"
          - "jsonType.label"             = "String"
          - "user.session.note"          = "identity_provider"
        } -> null
      - id              = "6ba975c2-87f9-4606-9183-002bfaea2ac1" -> null
      - name            = "IDP" -> null
      - protocol        = "openid-connect" -> null
      - protocol_mapper = "oidc-usersessionmodel-note-mapper" -> null
      - realm_id        = "onestopauth" -> null
    }

  # module.keycloak_test.module.onestopauth.module.client_aug-31-424-pm-1323.keycloak_generic_client_protocol_mapper.idir_userid_mapper will be destroyed
  - resource "keycloak_generic_client_protocol_mapper" "idir_userid_mapper" {
      - client_id       = "29c41173-7c35-4dd2-b532-85513c0168fb" -> null
      - config          = {
          - "access.token.claim"   = "true"
          - "claim.name"           = "idir_userid"
          - "id.token.claim"       = "true"
          - "jsonType.label"       = "String"
          - "user.attribute"       = "idir_userid"
          - "userinfo.token.claim" = "true"
        } -> null
      - id              = "1d890caa-540a-4cc5-aa56-e088ebd79f2a" -> null
      - name            = "idir_userid" -> null
      - protocol        = "openid-connect" -> null
      - protocol_mapper = "oidc-usermodel-attribute-mapper" -> null
      - realm_id        = "onestopauth" -> null
    }

  # module.keycloak_test.module.onestopauth.module.client_aug-31-424-pm-1323.keycloak_openid_client.this will be destroyed
  - resource "keycloak_openid_client" "this" {
      - access_type                              = "PUBLIC" -> null
      - client_id                                = "aug-31-424-pm-1323" -> null
      - client_secret                            = (sensitive value)
      - consent_required                         = false -> null
      - direct_access_grants_enabled             = false -> null
      - enabled                                  = true -> null
      - exclude_session_state_from_auth_response = false -> null
      - full_scope_allowed                       = true -> null
      - id                                       = "29c41173-7c35-4dd2-b532-85513c0168fb" -> null
      - implicit_flow_enabled                    = false -> null
      - name                                     = "aug-31-424-pm-1323" -> null
      - pkce_code_challenge_method               = "S256" -> null
      - realm_id                                 = "onestopauth" -> null
      - service_accounts_enabled                 = false -> null
      - standard_flow_enabled                    = true -> null
      - valid_redirect_uris                      = [
          - "https://www.google.ca",
        ] -> null
      - web_origins                              = [
          - "+",
        ] -> null
    }

  # module.keycloak_test.module.onestopauth.module.client_sasa-1553.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_test.module.onestopauth.module.client_sasa-1553.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_name_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_name"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_name"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_name"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_test.module.onestopauth.module.client_sasa-1553.keycloak_generic_client_protocol_mapper.bceid_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_test.module.onestopauth.module.client_sasa-1553.keycloak_generic_client_protocol_mapper.client_roles_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "client_roles_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"                   = "true"
          + "claim.name"                           = "client_roles"
          + "id.token.claim"                       = "true"
          + "jsonType.label"                       = "String"
          + "multivalued"                          = "true"
          + "userinfo.token.claim"                 = "true"
          + "usermodel.clientRoleMapping.clientId" = "sasa-1553"
        }
      + id              = (known after apply)
      + name            = "client_roles"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-client-role-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_test.module.onestopauth.module.client_sasa-1553.keycloak_generic_client_protocol_mapper.identity_provider_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "identity_provider_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"         = "true"
          + "access.tokenResponse.claim" = "false"
          + "claim.name"                 = "identity_provider"
          + "id.token.claim"             = "true"
          + "jsonType.label"             = "String"
          + "user.session.note"          = "identity_provider"
        }
      + id              = (known after apply)
      + name            = "IDP"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usersessionmodel-note-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_test.module.onestopauth.module.client_sasa-1553.keycloak_generic_client_protocol_mapper.idir_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_test.module.onestopauth.module.client_sasa-1553.keycloak_openid_client.this will be created
  + resource "keycloak_openid_client" "this" {
      + access_type                              = "PUBLIC"
      + client_id                                = "sasa-1553"
      + client_secret                            = (sensitive value)
      + consent_required                         = false
      + direct_access_grants_enabled             = false
      + enabled                                  = true
      + exclude_session_state_from_auth_response = false
      + full_scope_allowed                       = true
      + id                                       = (known after apply)
      + implicit_flow_enabled                    = false
      + name                                     = "sasa-1553"
      + pkce_code_challenge_method               = "S256"
      + realm_id                                 = "onestopauth"
      + resource_server_id                       = (known after apply)
      + service_account_user_id                  = (known after apply)
      + service_accounts_enabled                 = false
      + standard_flow_enabled                    = true
      + valid_redirect_uris                      = [
          + "http://b",
        ]
      + web_origins                              = [
          + "+",
        ]
    }

Plan: 21 to add, 2 to change, 42 to destroy.
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "target_env" but a value
│ was found in file "/terraform/terraform.tfvars". If you meant to use this
│ value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "target_aws_account_id"
│ but a value was found in file "/terraform/terraform.tfvars". If you meant
│ to use this value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵

------------------------------------------------------------------------

Cost estimation:

Waiting for cost estimate to complete...

Cost estimation:

Resources: 0 of 1967 estimated
           $0.0/mo +$0.0
```

</details>

*Pusher: @junmin-bcgov, Action: `pull_request`*